# Используем официальный образ Python как базовый
FROM python:3.8-slim

# Устанавливаем рабочую директорию в контейнере
WORKDIR /app

# Копируем только файл с зависимостями
COPY requirements.txt ./

# Устанавливаем зависимости
RUN pip install --no-cache-dir -r requirements.txt

# Копируем остальные файлы проекта
COPY . /app

# Открываем порт 5005 для внешнего доступа к серверу Rasa и 5055 для сервера действий
EXPOSE 5005 5055

# По умолчанию запускаем сервер Rasa
CMD ["rasa", "run", "--enable-api"]
